{"Blog/Elevate-Your-Obsidian-Experience-with-Smart-Connections":{"title":"Elevate Your Obsidian Experience with Smart Connections","links":[],"tags":[],"content":"This blog post was written with the help of Smart Connections and Smart Connect (currently in beta-testing with project supporters).\nWhat’s New in v2.1?\nSmart Connections v2.1 is packed with features designed for everyone—from the casual user to the power user:\n\n100+ AI Models: Now you have a veritable smorgasbord of AI models to choose from. Pick the perfect brain to match your workflow’s needs. Supports local models, Anthropic Claude, Google Gemini, Cohere Command-R, OpenAI GPT-4 &amp; Open Router with over 100 models including Meta’s Llama 3.\nLocal Chat Model Configuration: Keep your chats local and your data private. Use the local model configurations to use models running in Ollama and LM Studio with Smart Chat.\nRedesigned Smart Chat: Smart Chat has been rewritten from the ground up, setting the stage for future features like in-chat actions that promise to revolutionize your interactions.\n\n\nFeature Breakdown\n\nSmart Chat Enhancements: Essential settings like model selection in the Smart Chat window! This update lays the important groundwork necessary for these settings. Need more control? Let me know which settings you’d like to see by creating a feature request.\nChat History Feature: Never lose a good idea again. Every conversation is saved right back into your Obsidian vault, making it easy to revisit past insights. This also makes it easy for Smart Chat to re-use conversations as context in the future!\nSystem Prompts Feature: Another new addition is the ability to create and use system prompts that can be easily integrated into your chat conversations. Simply type @ to list notes from your smart prompts folder. Smart system prompts describe your preferences, like the custom instructions in ChatGPT, to reduce the input required for future queries. For example, I have a system prompt that specifies my coding preferences, and I use this when making a code related query.\nJS Brains: Code can be messy. And depending on other peoples code, code which often further depends on other people’s code, can get really messy really fast. JS Brains is a collection of open-source JavaScript modules I personally developed for Smart Connections for the explicit purpose of reducing dependencies on external code bases. I made some notes about why reducing dependencies is important for maintaining privacy and security here.\n\n\nStill wondering how to utilize Smart Connections? Here’s a brief story based on feedback from our community members.\nA Day with Smart Connections: Revolutionize Your Creative Process\nIntroduction Meet Sarah, a content creator juggling multiple projects while constantly seeking to optimize her research and creative output. Discover how Smart Connections revolutionizes her day, making her workflow seamless and her ideas interconnected.\nMorning: Jumpstarting Creativity Sarah begins her day with her Obsidian workspace. As she opens her project notes, Smart View suggests insightful articles and forgotten notes, acting as a personalized research assistant.\nMid-Morning: Uncovering Hidden Connections Smart View enables Sarah to navigate through suggested notes effortlessly, uncovering previously unnoticed connections. The links between her notes on narrative structures and character development spark fresh insights for her current novel.\nAfternoon: AI-Powered Brainstorming Stuck with a plot development, Sarah turns to Smart Chat. The AI, powered by her notes and Claude’s ingenuity, offers plot twists and character depths based on her previous work, turning the chat into an intimate brainstorming session.\nEvening: Reflection and Anticipation Reflecting on her productivity boost, Sarah appreciates how Smart Connections seamlessly integrates into her workflow, allowing more time for creation. She jots down ideas for tomorrow, eagerly anticipating Smart View’s upcoming suggestions.\nCommunity and Collaboration Sarah actively engages in the vibrant Smart Connections community forum, sharing experiences and learning from diverse users who provide support, tips, and inspiration.\nConclusion Experience a transformation in managing and creating with your notes, just like Sarah. Smart Connections enhances every step of your creative process, turning Obsidian into a powerhouse of efficiency and creativity. Join Sarah and countless others—download Smart Connections today and revolutionize your productivity.\nGetting Started with Smart Connections\nJump aboard the v2.1 train with these simple steps:\n\nOpen Obsidian.\nNavigate to ‘Community Plugins’ in Settings.\nFind Smart Connections and update to the latest version.\n\n\nJoin Our Community\nEngage with our community of thinkers and creators. Share your experiences, ask questions, or suggest new features—your input shapes the future of Smart Connections. Let’s work together to make note-taking and PKM smarter than ever!"},"Blog/Exploring-Smart-Connect-app-v1.3":{"title":"Exploring Smart Connect app v1.3","links":[],"tags":[],"content":"\nWatch on YouTube"},"Blog/Smart-Connections--and--Smart-Connect---Bringing-AI-to-Your-Obsidian-Vault":{"title":"Smart Connections & Smart Connect - Bringing AI to Your Obsidian Vault","links":[],"tags":[],"content":"Hey there, fellow knowledge explorers and productivity experts! 🌟 Are you ready to take your Obsidian note-taking to the next level? Obsidian has revolutionized the way we capture and connect our thoughts, but imagine harnessing the power of artificial intelligence to further enhance your workflow. That’s where Smart Connections and Smart Connect come in, offering a bridge between your Obsidian vault and the incredible capabilities of AI, and even a direct connection to ChatGPT.\nImportant distinction: Before we dive in, let’s clarify the difference between these two powerful tools:\n\nSmart Connections Obsidian Plugin: This plugin is the magic behind AI integration within Obsidian itself. It uses embedding models to understand the content and context of your notes, allowing for intelligent connections and insights without ever leaving your vault.\nSmart Connect Software: Think of this as a bridge between ChatGPT and Obsidian – it connects your Obsidian vault to ChatGPT, enabling you to chat directly with your notes and have ChatGPT perform actions within Obsidian without uploading your data to the cloud.\n\nUnveiling Hidden Relationships with Smart Connections\nFirst things first, let’s install the Smart Connections plugin from the Obsidian community plugins. Once installed and enabled, Smart Connections starts working behind the scenes, analyzing your notes and creating “embeddings.” These embeddings are like digital fingerprints that capture the essence of each note, allowing the AI to understand how they relate to each other.\nOne of the coolest features of Smart Connections is the “Smart View.” Imagine you’re working on a note about, say, “The Benefits of Meditation.” With Smart View enabled, a sidebar appears, displaying other notes in your vault that are contextually relevant to your current note. This could include notes on mindfulness, stress reduction, or even specific meditation techniques. 🧘‍♀️ It’s like having your own personal research assistant, surfacing connections you might have otherwise missed!\n\nChatting with Your Notes Using Smart Connect in ChatGPT\nReady to have a conversation with your knowledge base? Smart Connect makes it possible! Download and install the Smart Connect software, and let’s set up the connection. Within the software, you’ll specify the location of your Obsidian vault and give it a name (this helps ChatGPT identify it).\nWith everything connected, head over to the ChatGPT interface in your browser. Here, you can ask questions and give commands related to your Obsidian notes. For example:\n\n“List my notes” - ChatGPT will provide a list of your recent notes, complete with links to open them directly in Obsidian.\n“Give me organization ideas for my new Obsidian vault” - ChatGPT will generate a new note within your Obsidian vault containing suggestions for organizing your notes effectively.\n“Create PARA folders in my vault” - ChatGPT will automatically create the folders for the PARA method (Projects, Areas, Resources, and Archives) within your Obsidian vault, providing a structure to get you started.\n\n\nThese are just a few basic examples. The possibilities are truly endless! You can ask ChatGPT to summarize notes, find specific information, or even generate creative content based on your existing knowledge.\nJoin the Smart Connections Community\nSmart Connections is more than just software; it’s a community of passionate knowledge seekers and creators. Join us in the GitHub discussions to connect with other users, share your experiences, and learn from each other. There’s also a private chat available to project supporters where you can get prioritized support and further contribute to shaping the future of Smart Connections.\nEmbrace the Future of Note-Taking with AI\nSmart Connections and Smart Connect unlock a whole new dimension in knowledge management. By leveraging the power of AI, you can discover hidden connections, gain deeper insights, and boost your productivity within Obsidian. And the best part? This is just the beginning! As both software continue to evolve, we can expect even more innovative features and exciting possibilities.\nReady to join the AI revolution in Obsidian? Get Started with a Smart Connections today! Together, let’s explore the endless potential of AI-powered knowledge management!"},"Mission":{"title":"Mission","links":[],"tags":[],"content":"\nJoin the Future of AI: Personalize Your Smart Environment with Us\nEnhancing Your Abilities with Ethical AI: The Mission Behind Smart Connections\n"},"Prompt-Library":{"title":"Prompt Library","links":[],"tags":[],"content":"\n TODO\n\nCommunity contributed examples\n\nsame as contributing to docs\n\n\nDocumenting alignment prompt examples\n\nrequested during Lean Coffee September ‘24 (Stefano/Matthew)\n\n\n\n\n"},"Screenshot-Showcase":{"title":"Screenshot Showcase","links":[],"tags":[],"content":""},"Settings/Smart-Sources":{"title":"Smart Sources","links":[],"tags":[],"content":"Embedding Model\n\nDescription: The Embedding Model determines how your notes are converted into vector representations for AI processing.\nSelecting a Model:\n\nChoose from available models (e.g., &quot;TaylorAI/bge-micro-v2&quot;).\nConsider factors like model size and performance.\n\n\nPurpose:\n\nInfluences the quality and efficiency of AI understanding of your notes.\n\n\n\nMinimum Embedding Length\n\nDescription: Sets the minimum length for a note to be considered for embedding.\nSetting the Length:\n\nSpecify the minimum number of characters or words (e.g., 100 characters).\n\n\nImplications:\n\nShorter notes below this threshold are excluded from embedding.\nOptimizes performance by reducing unnecessary processing.\n\n\n\nGPU Batch Size\n\nDescription: Determines the number of embeddings processed simultaneously when using a GPU.\nSetting the Batch Size:\n\nEnter a numerical value based on your GPU capabilities.\nSet to 0 to disable GPU processing.\n\n\nGuidance:\n\nLarger batch sizes can improve speed but require more memory.\nAdjust according to your hardware specifications.\n\n\n\nLegacy Transformers\n\nDescription: Option to use older v2 transformer models instead of the default v3 models.\nWhen to Use:\n\nIf you experience issues with v3 models.\nFor compatibility with previous setups.\n\n\nHow to Enable:\n\nToggle Legacy Transformers to On.\n\n\n\nSmart Change (Change Safety)\n\nDescription: The Smart Change feature wraps AI-made changes, showing both original and modified versions.\nBenefits:\n\nProtects against accidental deletions or overwrites.\nAllows you to review and accept or reject changes.\n\n\nIn Obsidian:\n\nConverts into a UI for managing changes within the plugin.\n\n\nHow to Enable:\n\nToggle Smart Change to On.\n\n\nRecommendation:\n\nKeep enabled to maintain control over AI interactions with your notes.\n\n\n\nSmart Blocks\nEmbed Blocks\n\nDescription: Embedding blocks splits notes into smaller chunks (blocks), embedding them individually along with the whole note.\nHow to Activate:\n\nIn the Smart Sources section, toggle Embed Blocks to On (default is On).\n\n\nImpact on Data Processing:\n\nEnhances AI’s ability to retrieve specific content.\nIncreases the number of embeddings, potentially affecting performance.\n\n\nUse Cases:\n\nRecommended for longer notes with headings and bullet points.\nNot necessary for very short or atomic notes.\n\n\n\nLoading Sources\n\n\nDefault Behavior:\n\nSmart Connect does not load all embeddings by default to improve startup speed.\nAutomatically loads sources when ChatGPT requests content.\n\n\n\nManual Loading:\n\nLoad Sources:\n\nClick the Load Sources button to manually load all embeddings.\nUseful if you want immediate access to all notes.\n\n\nEmbedding Progress and Stats:\n\nView embedding percentage, number of sources, and load time after loading.\n\n\n\n\n\nImport and Refresh Actions:\n\nRun Import:\n\nProcesses new or updated notes for embedding.\nUse when you’ve added significant new content.\n\n\nRefresh All:\n\nReprocesses all notes, applying current settings.\nUse after changing exclusion settings or other configurations.\n\n\n\n\n\nUpdating Exclusion Settings:\n\nAfter changing exclusions, embeddings may show as partially loaded.\nClick Refresh All to reprocess notes with new settings.\nMonitor the embedding status to ensure completeness.\n\n\n\nTroubleshooting:\n\nIf embeddings aren’t updating or sources aren’t loading properly:\n\nClick Refresh All.\nUse Run Import if issues persist.\n\n\nBe aware of potential glitches; updates are ongoing to resolve them.\n\n\n\nAdditional Considerations\n\n\nPerformance Tips:\n\nEmbed Blocks increases the number of embeddings; consider disabling if performance is impacted.\nAdjust Minimum Embedding Length to prevent embedding content with less than the minimum length.\n\n\n\nFeedback and Support:\n\nReport errors or issues to support channels or the GitHub repository.\nProvide screenshots to assist in troubleshooting.\n\n\n"},"Smart-Connect-app/Creating-a-Custom-GPT-with-Smart-Connect":{"title":"Creating a Custom GPT with Smart Connect","links":[],"tags":[],"content":"This guide will help you create a custom GPT assistant that interacts with your Obsidian vault using the Smart Connect plugin.\nPreparation:\n\nObsidian &amp; Smart Connect: Ensure you have Obsidian and the Smart Connect plugin installed and set up.\nChatGPT Account: Creating custom GPTs requires a ChatGPT Plus subscription.\n\nCreating Your GPT Assistant:\n\nAccess GPTs: On ChatGPT, navigate to the “GPTs” section.\nCreate New GPT: Click “Create” and give your GPT a name and description (e.g., “Obsidian Assistant”).\nOptional Conversation Starters: Add example prompts to guide your GPT’s understanding of your needs.\n\nConnecting to Smart Connect:\n\nCreate Actions: Click the “Create new action” button.\n\nOpen API URL: In Smart Connect settings, locate and copy the “Open API” URL.\n\nImport Actions: In the ChatGPT Custom GPT editor, click “Add Actions” and paste the URL into “Enter Schema”. Click “Import”.\n\nExplore Actions: Review the list of available Smart Connect actions your GPT can perform (create notes, search, append content, etc.).\n\nAuthentication: In the ChatGPT editor, go to “Authentication” and choose “API Key” and “Bearer”.\n\n\nGet API Key: Find your unique API key in Smart Connect settings (keep it secure!).\n\nConnect: Paste the API key into the designated field within the ChatGPT editor.\nSave &amp; Test: Save your Custom GPT configuration and test its functionality. If issues arise, double-check your API key and connection.\n\nStart Exploring!\nWith your custom GPT connected to Obsidian, you can now:\n\nCreate and manage notes using natural language commands.\nSearch your vault effortlessly.\nInsert and append content to existing notes.\nAnd much more!\n\nRemember, the possibilities are endless. Get creative and discover a new way to interact with your knowledge base!"},"Smart-Connect-app/Custom-Actions":{"title":"Custom Actions","links":[],"tags":[],"content":"What are custom actions?\n\n“Custom Actions empower you to execute local functions with unparalleled ease, bypassing the complexities of server hosting. Simplify your development workflow and boost productivity with Smart Actions.”\n“Custom Actions make executing local functions as easy as flipping a switch. Say goodbye to the complexity of server hosting and hello to streamlined, efficient development.”\n"},"Smart-Connect-app/Settings-in-Smart-Connect":{"title":"Settings in Smart Connect","links":[],"tags":[],"content":"The Settings section allows you to configure global preferences, security options, and other important aspects of the Smart Connect app. This includes managing your connection to the Smart Connect Official Service, adjusting security settings, monitoring performance and token usage, and utilizing debugging tools to maintain optimal functionality.\nSecurity (Advanced)\n\n\nDescription: The Security toggle enables or disables HTTPS security features within the Smart Connect app. By default, this setting should be On to ensure secure communication when connecting via the Smart Connect Official Service.\n\n\nWhen to Disable:\n\nIf you’re running your own tunnel server instead of using the Smart Connect Official Service, you need to turn off the Security setting.\nDisabling security allows the app to connect through your custom server, but it also disables certain security features provided by the official service.\n\n\n\nPotential Risks and Mitigation:\n\nDisabling HTTPS security can expose your data to potential security risks.\nEnsure that your custom server is securely configured.\nBe cautious of unauthorized access when security is disabled.\n\n\n\nGlobal Settings\nAPI Key\n\n\nPurpose: The API Key functions as a password to secure your custom GPTs. It’s required when setting up Custom GPTs and ensures that only authorized users can access and modify your GPT configurations.\n\n\nUsage:\n\nCurrently set to a default value.\nIn future updates, this setting will become editable and may be relocated for better accessibility.\nIt’s important to keep your API Key confidential to maintain security.\n\n\n\nPrevent Sleep\n\n\nDescription: The Prevent Sleep toggle keeps your computer awake, preventing it from entering sleep mode while Smart Connect is running.\n\n\nWhen to Use:\n\nIf you need constant access to your notes via ChatGPT from other devices, such as your cell phone.\nUseful during long-running tasks or continuous data retrieval.\n\n\n\nHow to Enable:\n\nGo to Global Settings.\nToggle Prevent Sleep to On.\n\n\n\nBenefits:\n\nEnsures that Smart Connect remains active and accessible.\nPrevents interruptions in AI interactions due to the computer sleeping.\n\n\n\nAuto-Launch\n\n\nDescription: Enabling Auto-Launch starts the Smart Connect app automatically when your computer boots.\n\n\nHow to Enable:\n\nIn Global Settings, toggle Auto-Launch to On.\n\n\n\nBenefits:\n\nThe app is always ready for use without manual intervention.\nSaves time and ensures continuous availability.\n\n\n\nTrade-offs:\n\nMay slightly increase boot time.\nConsumes system resources upon startup.\n\n\n\nOfficial Service\nEmail\n\n\nPurpose: Enter the email address associated with your Smart Connect account. This email is linked to your official service credentials and is necessary for authentication.\n\n\nHow to Enter:\n\nIn the Official Service section, input your registered email address.\n\n\n\nConnection Key\n\n\nPurpose: The Connection Key links the app to your Smart Connect account, allowing secure communication with the official service.\n\n\nHow to Obtain:\n\nClick the Get Connection Key button within the app.\nFollow the instructions sent to your email to retrieve the key.\n\n\n\nHow to Enter:\n\nEnter the Connection Key in the designated field in the Official Service settings.\n\n\n\nWhen to Refresh:\n\nIf you experience connection issues.\nAfter resetting settings or reinstalling the app.\n\n\n\nStats\nInput Tokens\n\n\nDefinition: Input tokens represent the amount of data (in tokens) sent to ChatGPT based on requests from your conversations.\n\n\nUsage:\n\nHelps monitor how much information you’re sending to the AI.\nUseful for understanding and managing usage limits or costs.\n\n\n\nOutput Tokens\n\n\nDefinition: Output tokens are the tokens representing the context retrieved by ChatGPT from your notes.\n\n\nUsage:\n\nIndicates how much of your note content is being accessed by the AI.\nHelps track data retrieval and potential exposure of sensitive information.\n\n\n\nTotal Tokens\n\n\nCalculation: Total tokens are the sum of input and output tokens.\n\n\nPurpose:\n\nProvides an overall view of your token usage.\nImportant for tracking resource consumption and optimizing performance.\nCan help in managing any associated costs with token usage.\n\n\n\nLogs\nOpen Access Log\n\n\nPurpose: The Access Log records incoming requests to the Smart Connect app, providing transparency and security oversight.\n\n\nUsage:\n\nMonitor for unauthorized access attempts.\nReview the origins of requests to ensure they are legitimate.\n\n\n\nHow to View:\n\nNavigate to the Access Log section at the bottom of the Settings page.\n\n\n\nOpen Console Log\n\n\nPurpose: The Console Log is a diagnostic tool that provides detailed technical information for troubleshooting.\n\n\nHow to Open:\n\nClick Open Console Log within the Settings section.\nA new window will appear displaying log information.\n\n\n\nInterpreting the Console Log:\n\nFocus on the Console tab for relevant information.\nLook for errors or warnings highlighted in the log.\n\n\n\nWhen to Use:\n\nIf you encounter issues or unexpected behavior in the app.\nFor reporting errors to support channels.\n\n\n\nReporting Errors:\n\nTake a screenshot of any errors found.\nReport them via GitHub or through the support channels provided.\n\n\n\nDebug\nReset Settings\n\n\nPurpose: The Reset Settings function restores all app settings to their default configurations.\n\n\nWhen to Use:\n\nIf you’re experiencing issues due to incompatible or corrupt settings.\nAfter significant updates or when troubleshooting major problems.\n\n\n\nHow to Reset:\n\nClick Reset Settings in the Debug section.\nConfirm the action when prompted.\n\n\n\nWarning:\n\nAll custom configurations will be lost.\nYou will need to reconfigure your settings after the reset.\n\n\n\nNote:\n\nThe Reset Settings button is designed to be accessible even if other parts of the app are not functioning properly.\n\n\n\nShow GPU Details\n\n\nNote: This feature is generally not important for most users and may be removed in future versions.\n\n\nPurpose: Displays details about your system’s GPU.\n\n\nWhen to Use:\n\nOnly if instructed by support staff for troubleshooting performance issues.\n\n\n\nRecommendation:\n\nIgnore this setting unless specifically advised to use it.\n\n\n\nExample Scenarios and Use Cases\nConnecting to Smart Connect with Custom Security Settings\n\n\nScenario: You are running your own custom tunnel server and need to disable the default security settings to connect.\n\n\nSteps:\n\nNavigate to Settings &gt; Security (Advanced).\nToggle Security to Off.\nConfigure any additional settings that appear after disabling security.\nEnsure your custom server is securely set up to mitigate risks.\n\n\n\nImportant:\n\nDisabling security is only recommended for advanced users.\nBe aware of the potential security implications.\n\n\n\nMonitoring Token Usage for Performance Optimization\n\n\nScenario: You want to optimize the performance of your GPT interactions and manage resource usage.\n\n\nSteps:\n\nGo to Settings &gt; Stats.\nReview Input Tokens and Output Tokens to understand your usage patterns.\nUse this information to adjust your interactions or configurations to reduce unnecessary token consumption.\n\n\n\nBenefits:\n\nHelps in managing any costs associated with token usage.\nImproves efficiency and responsiveness of the AI.\n\n\n\nDebugging System Issues via Logs and Reset Settings\n\n\nScenario: You’re experiencing issues with the app and need to troubleshoot.\n\n\nSteps:\n\nOpen the Console Log via Settings &gt; Open Console Log.\nCheck for any errors or warnings.\nIf errors are found, take a screenshot and report them to support.\nIf issues persist, use Reset Settings to restore defaults.\nReconfigure your settings after the reset.\n\n\n\nTips:\n\nAlways backup important settings or configurations before resetting.\nUse the Access Log to check for any unauthorized access that might be causing issues.\n\n\n"},"Smart-Connect-app/Smart-Actions-in-Smart-Connect":{"title":"Smart Actions in Smart Connect","links":[],"tags":[],"content":"Smart Actions allow you to define how the AI interacts with your notes by specifying the operations it can perform. They are crucial for managing workflows and customizing AI behavior to suit your specific needs. With Smart Actions, you can leverage both official GPTs provided by the app and create your own custom GPTs. This flexibility enables you to integrate with official tools and community-created actions, tailoring the AI’s capabilities to enhance your productivity.\nSmart Actions\nOfficial GPTs\nNotes\nThe Notes official GPT is designed for standard note interaction within your Smart Environments. It allows the AI to read, create, and modify notes according to your instructions. This GPT utilizes your configured Smart Environment to access and process your notes, enabling seamless integration between your note-taking workflow and AI assistance.\nNotes v2 (Experimental)\nThe Notes v2 (Experimental) GPT introduces new features and improvements over the standard Notes GPT. It includes experimental capabilities such as enhanced note retrieval, better integration with Smart Environments, and advanced actions that can be tested and refined.\nSmart Environment Selection\nTo use the Notes v2 GPT effectively, you need to select the appropriate Smart Environment:\n\nNavigate to the Smart Actions section in the Smart Connect app.\nUnder Official GPTs, find Notes v2 (Experimental).\nIn the GPT settings, locate the Smart Environment dropdown.\nSelect the Smart Environment that corresponds to your Obsidian vault or the environment you wish to use for testing.\n\nRun Tests for Notes v2\nTo test the experimental GPT and interpret the results:\n\nOpen ChatGPT and select the Notes v2 (Experimental) GPT.\nStart by issuing simple commands, such as “Read my open notes” or “Find more notes about [topic]“.\nObserve how the AI interacts with your notes:\n\nCheck if it retrieves the correct notes.\nVerify if it opens notes in Obsidian when prompted.\n\n\nMonitor the Console Log in the Smart Connect app for any errors or issues.\nProvide feedback or report any glitches to improve the GPT’s performance.\n\nTranscribe\nThe Transcribe GPT action is optimized for converting spoken words or audio content into written notes within your Obsidian vault. It focuses on creating and appending content to notes, making it ideal for transcribing lectures, meetings, or voice memos.\nTo enable or run the Transcribe GPT:\n\nIn the Smart Connect app, go to Smart Actions.\nUnder Official GPTs, find Transcribe GPT.\nConfigure the Folder setting to specify where transcribed notes should be saved (e.g., your Inbox folder).\nEnsure that only the Create and Append actions are enabled to streamline the transcription process.\nUse ChatGPT with the Transcribe GPT to begin transcribing audio content into your notes.\n\nCustom GPTs\nDefault GPT Action Group (Deprecated)\nImportant Notice: The Default GPT action group is being deprecated and will be removed in future updates. This group previously served as a catch-all for custom GPTs that had not been updated to the new system. It is critical to replace any GPTs relying on the default action group with newly created custom GPTs to ensure continued functionality.\nMigrating to Custom GPTs:\n\nIdentify any custom GPTs using the default action group.\nCreate a new custom GPT following the steps in the next section.\nReconfigure your settings and actions within the new custom GPT.\nTest the new GPT to confirm it operates as expected.\nDelete the old GPT that was using the default action group.\n\nCustom GPT Creation\nCreating and managing Custom GPTs allows you to tailor the AI’s capabilities to your specific workflows. Here’s how to create a new Custom GPT:\n\nIn the Smart Connect app, navigate to Smart Actions.\nClick the New Custom GPT button.\nA new entry (e.g., Custom 1) will appear in the Custom GPTs section.\nRename the custom GPT for clarity by clicking on its name and typing a new one (e.g., Notes Management GPT).\n\nConfiguring Custom GPTs:\nAlignment File\n\nPurpose: The Alignment File provides custom instructions and context to guide the AI’s behavior.\nHow to Upload:\n\nIn your custom GPT settings, find the Alignment File field.\nClick on it and navigate to the file containing your custom instructions.\nSelect the file to upload it to the GPT configuration.\n\n\n\nAlignment Text\n\nPurpose: Allows you to input direct alignment text as custom instructions without using a file.\nHow to Input:\n\nLocate the Alignment Text field in your custom GPT settings.\nType or paste your custom instructions directly into the text area.\n\n\n\nSmart Environment Selection\n\nPurpose: Specifies which Smart Environment the custom GPT will use to access notes.\nHow to Select:\n\nIn the custom GPT settings, find the Smart Environment dropdown menu.\nSelect the appropriate environment that contains the notes you want the GPT to interact with.\n\n\n\nShow Custom GPT Setup Details\nThe Setup Details section provides necessary information for integrating your custom GPT with ChatGPT.\n\n\nOpenAPI URL:\n\nPurpose: Supplies ChatGPT with the definitions of available actions.\nHow to Use:\n\nCopy the OpenAPI URL provided in the Setup Details.\nIn ChatGPT, access the GPT editor and look for an option to import from a URL.\nPaste the OpenAPI URL to import the action definitions.\n\n\n\n\n\nGPT URL Input:\n\nPurpose: Enhances the OpenAPI by reducing the amount of text ChatGPT needs to process, minimizing confusion.\nHow to Use:\n\nCopy the GPT URL from the Setup Details.\nPaste it into the corresponding field in ChatGPT’s GPT editor.\n\n\n\n\n\nAdvanced Configuration Options\n\n\nAvailable Actions:\n\nPurpose: Customize which actions the AI can perform, reducing unnecessary options and focusing the AI’s capabilities.\nHow to Add Actions to the Group:\n\nIn the Advanced Configuration section, locate the Available Actions dropdown.\nClick on it and select the specific actions you want to include (e.g., Create, Append, Alignment).\nThe settings in the upper area will update based on the selected actions.\n\n\n\n\n\nDependency of Settings on Selected Actions:\n\nCertain settings, such as Alignment File/Text, will only appear if the corresponding action (e.g., Alignment action) is included.\nTip: Add all the necessary actions first to ensure all required settings are available for configuration.\n\n\n\nManaging Actions\nManaging actions within your custom GPT is crucial for tailoring the AI’s behavior.\nAdd Action to Group\n\nHow to Add Specific Actions:\n\nIn your custom GPT settings, go to the Advanced Configuration section.\nUnder Available Actions, click the dropdown menu.\nSelect the actions you wish to add to the GPT (e.g., Notes V1 Create, Notes V1 Append).\nThe GPT will now have access only to these specified actions.\n\n\n\nDelete Custom GPT\n\nHow to Delete an Existing Custom GPT:\n\nIn the Custom GPTs list, find the GPT you wish to delete.\nClick on the Delete or Trash icon next to it.\nConfirm the deletion when prompted.\n\n\nNote: Deleting a custom GPT will remove its configuration and could disable any workflows or tasks linked to it. Ensure you have migrated or no longer need the GPT before deleting.\n\nRun Tests for Custom GPT\n\nHow to Run Tests:\n\nAfter configuring your custom GPT, open ChatGPT.\nSelect your custom GPT from the list.\nIssue commands or prompts that utilize the actions you’ve configured.\nObserve the AI’s responses to ensure it behaves as expected.\n\n\nInterpreting the Output:\n\nVerify that the AI is performing the correct actions on the intended notes.\nCheck for any errors or unexpected behavior.\nAdjust your GPT’s configuration as necessary based on the test results.\n\n\n\nCommunity Actions\n\nFinding and Integrating Community Actions:\n\nCommunity actions are pre-built actions created by other users that you can incorporate into your custom GPTs.\nHow to Access:\n\nVisit the community repository or platform where actions are shared.\nBrowse through the available actions and select ones that suit your needs.\nDownload or copy the action definitions.\n\n\nIntegrating into Your GPT:\n\nIn your custom GPT’s Advanced Configuration, use the Available Actions dropdown to add the community actions.\nEnsure you have any necessary alignment files or settings required by the action.\nTest the GPT to confirm the community action works correctly.\n\n\n\n\n\nExample Use Cases\nCreating a Custom GPT for Notes Management\nObjective: Set up a custom GPT that can summarize and categorize notes.\nSteps:\n\n\nCreate a New Custom GPT:\n\nNavigate to Smart Actions and click New Custom GPT.\nRename it to Notes Management GPT.\n\n\n\nConfigure Alignment Instructions:\n\nIn Alignment Text, input instructions guiding the AI to summarize and categorize notes.\n\n\n\nSelect Smart Environment:\n\nChoose the Smart Environment containing the notes you wish to manage.\n\n\n\nAdd Relevant Actions:\n\nIn Advanced Configuration, add actions such as Summarize Note, Categorize Note, List Categories.\n\n\n\nSet Up OpenAPI and GPT URLs:\n\nCopy the OpenAPI URL and GPT URL from Setup Details.\nImport them into ChatGPT’s GPT editor.\n\n\n\nTest the GPT:\n\nUse ChatGPT to issue commands like “Summarize the note titled ‘Project Plan’” or “Categorize notes related to ‘Marketing’“.\nVerify the AI performs the tasks accurately.\n\n\n\nAdding and Testing Transcription GPT\nObjective: Set up a transcription GPT for converting audio content into notes.\nSteps:\n\n\nCreate a New Custom GPT:\n\nClick New Custom GPT and rename it to Transcription GPT.\n\n\n\nConfigure Actions:\n\nIn Advanced Configuration, add Notes V1 Create and Notes V1 Append actions.\n\n\n\nSet Target Folder:\n\nIn the GPT settings, specify the Folder where transcribed notes will be saved (e.g., Inbox).\n\n\n\nInput Alignment Instructions:\n\nUse Alignment Text to instruct the AI on formatting transcriptions and handling specific scenarios.\n\n\n\nSet Up Integration:\n\nCopy the OpenAPI URL and GPT URL from Setup Details.\nImport them into ChatGPT.\n\n\n\nTest the Transcription GPT:\n\nIn ChatGPT, input or upload audio content (if supported).\nCommand the AI to transcribe the content into a note.\nCheck Obsidian to ensure the note is created in the specified folder with the correct content.\n\n\n"},"Smart-Connect-app/Smart-Environments-in-Smart-Connect":{"title":"Smart Environments in Smart Connect","links":["+🧩-Smart-Ecosystem/docs-(public)/docs.sc/Settings/Smart-Sources"],"tags":[],"content":"Smart Environments are a core component of the Smart Connect app, designed to provide seamless integration between your local notes and AI-powered processing. By defining which files are accessible and how they are processed, Smart Environments empower users to interact with their data in a more intelligent and personalized manner. Whether you’re managing your knowledge base, syncing content from Obsidian, or excluding specific sections from processing, Smart Environments offer flexible configuration options tailored to your needs.\nThe goal is to put users in control—enabling personal alignment with AI tools while keeping data secure and local. With features like selective embedding, Obsidian compatibility, and advanced customization options, Smart Environments make it easy to integrate your personal workflows with the power of AI while maintaining privacy and relevance.\nNew Environment\n\n\nCreating a New Environment:\n\nOpen the Smart Connect app.\nIf no environments are found, click the New Environment button.\nClick on the Folder field to select your Obsidian vault folder.\nThe new environment will appear in the Smart Environments list.\n\n\n\nRenaming the Environment:\n\nIt’s recommended to rename the environment to match your vault name for compatibility with Obsidian-specific features.\n\nRight-click on the new environment and select Rename.\nEnter the exact name of your Obsidian vault.\nPress Enter to save the new name.\n\n\n\n\n\nDelete Environment\n\nRight-click on the environment and select Delete (or click the delete icon if available).\nConsiderations:\n\nDeleting an environment will remove its configuration and associated settings.\nEmbedded data and settings specific to that environment will be lost.\nThis action cannot be undone, so proceed with caution.\n\n\n\nName\n\nThe Name field specifies the name of your Smart Environment.\n\nRecommendation: Set the environment name to match your Obsidian vault name.\n\nEnsures compatibility with Obsidian-specific features.\nFacilitates synchronization between the app and the Obsidian plugin.\n\n\n\n\n\nFolder\n\nThe Folder setting defines the directory where your notes are stored.\n\nSelecting a Folder:\n\nClick on the Folder field.\nNavigate to your Obsidian vault directory.\nSelect the folder containing your notes.\n\n\nPurpose:\n\nSpecifies the source of notes for embedding and AI interaction.\n\n\n\n\n\nObsidian Vault Toggle\n\nThe Obsidian Vault Toggle indicates whether the environment is linked with an Obsidian vault.\n\nActivating the Toggle:\n\nToggle it On if you’re using Obsidian.\nMay be toggled on by default if the Smart Connections Obsidian plugin is running.\n\n\nBenefits:\n\nSynchronizes settings between Smart Connect and Obsidian.\nShares the same Smart Environment configuration file.\nEnsures compatibility with Obsidian-specific features.\n\n\n\n\n\nFile Exclusions\n\nPurpose: Exclude specific files from being embedded and processed by the AI.\nHow to Set File Exclusions:\n\nIn the environment settings, find the File Exclusions field.\nEnter the names or patterns of files to exclude (e.g., Untitled.md, Smart Chats.md).\n\n\nUsage:\n\nPrevents certain files from being included in embeddings.\nUseful for excluding temporary files or notes not relevant to AI interactions.\n\n\n\nFolder Exclusions\n\nPurpose: Exclude entire folders from embedding and AI processing.\nHow to Set Folder Exclusions:\n\nLocate the Folder Exclusions field in the environment settings.\nEnter the names or paths of folders to exclude (e.g., Templates/, Archive/).\n\n\nUsage:\n\nExcludes all notes within specified folders.\nHelps manage large vaults by omitting irrelevant sections.\n\n\n\nExcluded Headings\n\nPurpose: Exclude specific headings or sections within notes from being embedded.\nHow to Set Excluded Headings:\n\nIn the environment settings, find the Excluded Headings option.\nEnter the headings or patterns to exclude (e.g., # Drafts, ## Personal).\n\n\nUsage:\n\nPrevents sensitive or irrelevant sections from being processed.\nEnhances privacy and relevance of AI interactions.\n\n\n\nSmart Sources settings\nSee Smart Sources to learn more about settings for sources and blocks."},"Smart-Connect-app/Videos":{"title":"Videos","links":[],"tags":[],"content":"Getting Started\n\nExploring the next Smart Connect update: A walkthrough from Obsidian Folder Setup to Custom GPTs\nGetting Started with Smart Connect\nWelcome to Smart Connect v1.2: Simple Setup and Overview\n\nInformational\n\nHow Smart Connect Bridges ChatGPT &amp; Local Notes Without the Cloud\n"},"Smart-Connections-Obsidian-plugin/Getting-Started-with-the-Private-Chat-for-Smart-Connections-Supporters":{"title":"Getting Started with the Private Chat for Smart Connections Supporters","links":[],"tags":[],"content":"After signing up using the special link in your supporter welcome email:\n\nDownload and Installation: The Smart Connections chat can be used in the web browser and through Progressive Web Apps (PWA) technology on mobile devices. This means there’s no need to download the app from app stores.\nAccessing Campfire: Simply navigate to the chat on your mobile browser. The website should prompt you to “Add to Home Screen.” This adds an icon to your device, allowing for quicker access, much like a native app.\nEnable Notifications: Once Campfire is added to your home screen, you can manage notifications for each “chat room” by clicking the icon at the top of the page to change the level of notifications between “all new messages,” “mentions only,” and “none.”\n"},"Smart-Connections-Obsidian-plugin/Help-debug-Smart-Connections-issues":{"title":"Help debug Smart Connections issues","links":[],"tags":[],"content":"The steps necessary to help me debug an issue at start-up.\n\n\nmake sure this setting in Obsidian is toggled on\n\n\n\nopen the developer console logs (on windows: CTRL+SHIFT+i)\n\n\n\nClear the logs:\n\n\n\nDisable &amp; Re-enable Smart Connections\n\n\n\nScreenshot errors in the logs and send them to me for review. Errors are usually highlighted red like this:\n\n\n\nIf you don’t see any errors, screenshots are often still helpful."},"Smart-Connections-Obsidian-plugin/Inspect-blocks-created-for-a-note":{"title":"Inspect blocks created for a note","links":[],"tags":[],"content":"\nClick the Note Name: In the Smart Connections pane (see arrow on right-hand side of screenshot), click on the note name in the bottom left corner of the pane. This will open a modal displaying the block contents.\nModal View: The modal will pop up, showing detailed information about the note blocks, including:\n\nBlock Contents: Lists the content in the block.\nContent Length: Displays the number of characters (e.g., 225 chars).\nEmbed Status: Indicates whether the block should be embedded. This can be changed by updating the “Minimum Embedding Length” setting.\n\n\n\n"},"Smart-Connections-Obsidian-plugin/Manual-Re-Embedding-for-Specific-Notes":{"title":"Manual Re-Embedding for Specific Notes","links":[],"tags":[],"content":"To re-embed a single note within Obsidian, use the “Refresh &amp; make connections” command."},"Troubleshooting":{"title":"Troubleshooting","links":["Smart-Connections-Obsidian-plugin/Help-debug-Smart-Connections-issues"],"tags":[],"content":"Smart Connections Obsidian plugin\n\nHelp debug Smart Connections issues\n\nEmbedding processing\nWas it working previously?\nTry using the legacy version of HuggingFace Transformers. Turn on this setting in the Smart Connections settings.\n\nSmart Connect app\n\nOpen the Console Logs and look for errors\n\nEnsure Environment is set in Smart Action Group\n\nKeeps trying to connect\n\nDo you see a 401 error in the console?\n\nmake sure your connection key is correct and active\n\n\nDo you see a 500 error in the console?\n\nmake sure your email is correct (same as where connection key was sent, case-sensitive)\n\n\n\nStill need help? Submit an issue on GitHub\n\nSmart Connect issues\nSmart Connections issues\n"},"Workflows":{"title":"Workflows","links":[],"tags":[],"content":"Videos\n\nConnect Obsidian to Make.com with Smart Connect\nHow Accurate is ChatGPT at Transcribing Handwritten Notes? Find Out!\nHow I Use Smart Connect Transcribe GPT for Effortless Note-Taking: My Workflow Explained!\nExploring Smart Templates Plugin 🧩: Real-Time Test &amp; Demo!\nStreamline Your Workflow: Summarize PDFs to Notes in Obsidian with Smart Connect &amp; ChatGPT\n"},"index":{"title":"Smart Ecosystem","links":["Mission","Workflows"],"tags":[],"content":"Smart Connections\n\nDocs\n\nSmart Connect app\nSmart Connections Obsidian plugin\n\n\nBlog\nMission\nWorkflows\n\nObsidian\nInstall Obsidian Plugin\nView code on GitHub\n\nChatGPT\nSmart Connect App\nNotes GPT\n\nCommunity\nPrivate Community\nPublic Discussion on GitHub\n\nOpen-source\n\nJS Brains\nObsidian Smart Connections\nObsidian Smart Templates\nSmart Connect\n\nVideos\n\nGetting Started with Obsidian, Smart Connections &amp; Smart Connect for ChatGPT\n\nYouTube Playlists\nSmart Connect app\nObsidian Smart Connections plugin\nGitHub\n\nObsidian Smart Connections\nObsidian Smart Templates\nSmart Connect\nJS Brains\n"}}